{
    "Loading" : "Loading...",
    "Landing hi" : "Hi, I'm Corentin Leguay,",
    "Fullstack dev" : "a full-stack developer.",
    "Welcome portfolio" : "Welcome to my portfolio.",
    "Scroll down" : "Scroll down to see more",
    "About me" : "About me",
    "About me first" : "New technologies enthusiast, I always wished to become a part of its world. I started this learning journey by myself, developping little games and setting up servers to play with others.",
    "About me second" : "Now, I've a two-year university degree in computer sciences, and a bachelor's degree in web development, and I'm ready to set out on new experiences.",
    "Roleplay" : "Roleplay",
    "Roleplay alt" : "Dice D20 icon",
    "Roleplay text" : "I started roleplaying since many years. I continue to write scenarios, and ideas regularly.",
    "Travel" : "Travel",
    "Travel alt" : "Travel icon",
    "Travel text" : "I traveled to New Zealand, UK, Canary Islands, Greece, and more... I now wish to go to Iceland, Japan and go back to New Zealand.",
    "Pop culture" : "Pop culture",
    "Pop culture alt" : "Space Invaders icon",
    "Pop culture text" : "I always loved pop culture, in many form. Art, video games, mangas/comics, movies, etc...",
    "Music" : "Music",
    "Music alt" : "Metal sign icon",
    "Music text" : "I love many genres of music, and love to discover new artists. I like mainly metal/hard rock, and rap.",
    "Projects" : "Projects",
    "Github" : "Github",
    "Website" : "Website",
    "Itchio" : "Itch.io",
    "Eportfolio" : "E-Porfolio (2022)",
    "Eportfolio first" : "This website is developed with React.js, and React Three Fiber (Three.js). I choose this stack since I wanted to try three.js, and develop my skills on React.",
    "Eportfolio second" : "I used the various skills I gained by developing video games on three.js to make it happen and to optimize the WebGL scene.",
    "MyBlazon" : "MyBlazon (2021-2022)",
    "MyBlazon first" : "I worked as a full-stack developer for one year on MyBlazon.com, a website that generates blazon online. It's developed in .NET 6, and HTML, LESS, and JS (with Jquery) for the front.",
    "MyBlazon second" : "I had many tasks, to tell a few : I refactored and migrated the website to .NET 6 (it was in .NET 4.5 before), I improved the website design, and the blazon generator by developing new features for it, and finally, I also trained other interns.",
    "Endless Wander" : "Endless Wander (2020-2022)",
    "Endless Wander first" : "Endless Wander is an RPG (RolePlaying Game) I worked on with Ederia Interactive, my video game studio. It’s developed with Unreal Engine, in C++.",
    "Endless Wander second" : "Working on this big project with a small team made me take on many jobs : UI/UX designer, developer (AI, UI, and many more), scriptwriter, etc...",
    "Ederia Interactive" : "Ederia Interactive (2020-2021)",
    "Ederia Interactive first" : "I worked on Ederia Interactive's website. It's developed in Angular 10, the news system was done with Markdown, and the website is deployed with Docker.",
    "Ederia Interactive second" : "I was alone on this project. I had to design a mock-up, develop the website and its news system.",
    "ClicknBoat" : "Click & Boat (2019)",
    "ClicknBoat first" : "As an intern for 3 months at Click & Boat, I developed a monitoring tool that was destined to run on Raspberry Pi, and displayed on screens in the office of each team. It was done in Angular, and HighchartsJS.",
    "ClicknBoat second" : "I had to talk with each team to figure out their needs, and then develop the web application.",
    "Flappy bird" : "Flappy bird clone (2019)",
    "Flappy bird first" : "As my first project on Unity, I developed a flappy bird clone. I wanted to try out the game engine and to learn how to use it.",
    "Flappy bird second" : "I learned how to use different aspects of the engine by programming the character's and the obstacle's movements, the obstacle generator, the score system, and menu scenes.",
    "Huun" : "Huun (2018-2019)",
    "Huun first" : "I developed Huun in a team of 10 for a PhD student. The mobile application was developed in React Native, and the website (back-office) with HTML, CSS, PHP and MySQL.",
    "Huun second" : "My tasks were to program the settings related views (settings, about, credits), and the notification system (a key feature needed for the study).",
    "Contact me" : "Contact me",
    "Contact question" : "Do you have a question or do you want to work together ? Send me an email, or contact me on Linkedin.",
    "Send email" : "Send me an email",
    "Linkedin" : "Linkedin",
    "If resume" : "If you want to look at my resume, you can also download it here.",
    "Download resume" : "Download my resume",
    "Credits to" : "Credits to",
    "Credits phone" : "for phone model",
    "Credits envelopes" : "for the envelopes model",
    "Credits D20" : "for the D20 icon", 
    "and" : "and",
    "Credits metal" : "for the metal sign icon",
    "Change lang" : "Change language to"
}