{
    "Loading" : "Chargement...",
    "Landing hi" : "Bonjour, je suis Corentin Leguay,",
    "Fullstack dev" : "un développeur full-stack.",
    "Welcome portfolio" : "Bienvenue sur mon portfolio.",
    "Scroll down" : "Défilez vers le bas pour en voir plus",
    "About me" : "A propos de moi",
    "About me first" : "Fan de nouvelles technologies, j'ai toujours souhaité faire partie de ce monde. J'ai commencé mon apprentissage en autodidacte, en développant de petits jeux et des serveurs pour jouer en ligne avec des amis.",
    "About me second" : "Maintenant, j'ai un DUT en Informatique, et une licence professionelle en développement web et mobile, et je suis prêt à me lancer dans de nouvelles expériences.",
    "Roleplay" : "Jeu de rôle",
    "Roleplay alt" : "Icone D20",
    "Roleplay text" : "J'ai commencé à faire du jeu de rôle il y a des années. Je continue à écrire des scénarios, et de nouvelles idées régulièrement.",
    "Travel" : "Voyage",
    "Travel alt" : "Icone voyage",
    "Travel text" : "J'ai voyagé en Nouvelle-Zélande, au Royaume-Uni, aux Îles Canaries, en Grèce, et plus encore... Je souhaite maintenant voyager en Islande, au Japon, et retourner en Nouvelle-Zélande.",
    "Pop culture" : "Pop culture",
    "Pop culture alt" : "Icone Space Invaders",
    "Pop culture text" : "J'ai toujours aimé la pop culture, et ce dans beaucoup de formes. Art, jeux vidéos, mangas/comics, films, etc...",
    "Music" : "Musique",
    "Music alt" : "Icone signe des cornes",
    "Music text" : "J'aime beaucoup de genre de musique, et j'adore découvrir de nouveaux artistes. J'aime principalement le metal/hard rock, et le rap US.",
    "Projects" : "Projets",
    "Github" : "Github",
    "Website" : "Site web",
    "Itchio" : "Itch.io",
    "Eportfolio" : "E-Porfolio (2022)",
    "Eportfolio first" : "Ce site web a été developpé en React.js, et React Three Fiber (Three.js). J'ai choisi cette stack car je souhaitais essayer three.js, et développer mes compétences en React.",
    "Eportfolio second" : "J'ai utilisé les différentes compétences que j'ai acquises en développant des jeux vidéos sur three.js pour créer et optimiser la scène WebGL.",
    "MyBlazon" : "MyBlazon (2021-2022)",
    "MyBlazon first" : "J'ai travaillé en tant que développeur web full-stack pendant un an sur MyBlazon.com, un site web qui génère des blazons en ligne. Il est développé en .NET 6, et en HTML, LESS, et JS (avec JQuery) pour le front.",
    "MyBlazon second" : "J'ai eu de nombreuses tâches, et pour en citer quelques unes : J'ai refactorisé et fait migrer le site à .NET 6 (auparavant en .NET 4.5), j'ai amélioré le design du site, et le générateur de blazon en y développant de nouvelles fonctionnalités, enfin, j'ai formé d'autres alternants/stagiaires sur les technologies utilisées.",
    "Endless Wander" : "Endless Wander (2020-2022)",
    "Endless Wander first" : "Endless Wander est un RPG (RolePlaying Game) sur lequel j'ai travaillé avec Ederia Interactive, mon studio de jeu vidéo. Il a été développé sur Unreal Engine, en C++.",
    "Endless Wander second" : "Travailler sur un aussi gros projet avec une petite équipe m'a fait prendre de nombreuses casquettes : UI/UX designer, développeur (IA, UI, et plus encore), scénariste, etc...",
    "Ederia Interactive" : "Ederia Interactive (2020-2021)",
    "Ederia Interactive first" : "J'ai développé le site web d'Ederia Interactive en Angular 10, le système de news a été réalisé avec du Markdown, et le site a été déployé avec Docker.",
    "Ederia Interactive second" : "J'étais seul sur ce projet. J'ai donc dû designer la maquette, développer le site et son système de news.",
    "ClicknBoat" : "Click & Boat (2019)",
    "ClicknBoat first" : "Durant un stage de 3 mois à Click & Boat, j'ai développé un outil de monitoring destiné à tourner sur un Raspberry Pi et à être affiché sur des écrans dans les bureaux de chaque équipe. Il a été réalisé en Angular, et HighchartsJS.",
    "ClicknBoat second" : "J'ai dû détailler les besoins de chaque équipe, et ensuite développeur l'application web.",
    "Flappy bird" : "Clone de Flappy bird (2019)",
    "Flappy bird first" : "Comme premier projet sur Unity, j'ai programmé un clone de flappy bird. Je voulais essayer le moteur de jeu et apprendre à l'utiliser.",
    "Flappy bird second" : "J'ai appris comment fonctionnent différents aspects du moteur en développant les mouvements du joueur et des obstacles, le générateur d'obstacles, le système de score, et les scènes pour les menus.",
    "Huun" : "Huun (2018-2019)",
    "Huun first" : "J'ai développé Huun dans une équipe de 10 pour une doctorante. L'application mobile a été développé en React Native, et le site web (back-office) en HTML, CSS, PHP et MySQL.",
    "Huun second" : "Mes tâches étaient de programmer les vues des options (options, à propos, crédits), et les notifications (une fonctionnalité clé pour l'étude de la doctorante).",
    "Contact me" : "Contactez-moi",
    "Contact question" : "Vous avez une question, ou vous souhaitez travailler avec moi ? Envoyez-moi un mail, ou contactez moi sur Linkedin.",
    "Send email" : "Envoyez-moi un mail",
    "Linkedin" : "Linkedin",
    "If resume" : "Si vous souhaitez jeter un oeil à mon CV, vous pouvez le télécharger ici.",
    "Download resume" : "Télécharger mon CV",
    "Credits to" : "Tout droits réservés à",
    "Credits phone" : "pour le modèle de téléphone",
    "Credits envelopes" : "pour le modèle d'enveloppes",
    "Credits D20" : "pour l'icone de D20", 
    "and" : "et",
    "Credits metal" : "pour l'icone du signe des cornes",
    "Change lang" : "Changez la langue à "
}